controllers/LoginController.php

    public  function  actionLogin()
    {
        $con=\Yii::$app->request;
        $name=$con->post('u_name');
        $pwd=$con->post('u_pwd');

        $info = Users::findAll(array('u_name'=>$name));
        if($info){
            if(Users::findAll(array('u_pwd'=>$pwd)))
---
SELECT * FROM `users` WHERE `u_name`='admin'
SELECT * FROM `users` WHERE `u_pwd`='1'