controllers/MenuController.php

	public function actionIndex(){

	   header("content-type:text/html;charset=utf-8");
	   $session = \Yii::$app->session;
       $session->open();
       $id=isset($session["id"])?$session["id"]:null;
	   $menu = Menu::find()
		->where(['pub_id' => $id])
		->one();
---
SELECT * FROM `menu` WHERE `pub_id`='15'