controllers/NumController.php

	public function actionShow(){
		$query = PublicNumber::find();
		$session = Yii::$app->session;
    	$session->open();
    	$id=$session->get("id",0);
		$countQuery = clone $query;
		$pages = new Pagination(['totalCount' => $countQuery->count()]);
		$models = $query->offset($pages->offset)
			->limit($pages->limit)
			->all();
---
SELECT COUNT(*) FROM `public_number`
SELECT * FROM `public_number` LIMIT 20

	public function actionEdit(){
        $request=Yii::$app->request;
		$id=$request->get('id');
		$query = PublicNumber::find()->where(['pub_id'=>$id])->one();
---
SELECT * FROM `public_number` WHERE `pub_id`='8'

	public function actionDelete(){
        $request=Yii::$app->request;
		$id=$request->get('id');
		$query = PublicNumber::deleteAll('pub_id='.$id);
		$querys = Access::deleteAll('pub_id='.$id);
		$queryss = Menu::deleteAll('pub_id='.$id);
---
DELETE FROM `public_number` WHERE pub_id=4
DELETE FROM `access` WHERE pub_id=4
DELETE FROM `menu` WHERE pub_id=4

    public function actionAdd(){
		$pub = new PublicNumber;
		$request=Yii::$app->request;
		$data=$request->post();
		$data['pub_type']=4;
		$data['pub_token']=$this->random(32,'all');
		$data['pub_code']=$this->random(6,'all');
		$data['u_id']=1;
		foreach($data as $k=>$v){
			$pub->$k=$v;
		}
		$access_token=$this->getAccessToken($data['pub_appid'],$data['pub_appsecret']);
		if($access_token==null){
			echo "<script>alert('appid或appsecret错误');history.go(-1)</script>";
		}else{
			if($pub->save()>0){
				$access = new Access();
				$arr=array(
					'acc_addtime'=>time(),
					'pub_id'=>$pub->pub_id,
					'acc_token'=>$access_token
				);
				$access->attributes=$arr;
				if($access->save()>0){
					$menus=$this->getMenu($pub->pub_id,$pub->pub_appid,$pub->pub_appsecret);
					$menu=new Menu();
					$menu->pub_id=$pub->pub_id;
					$menu->m_name=$menus;
					$menu->save();
---
INSERT INTO `public_number` (`pub_name`, `pub_appid`, `pub_appsecret`, `pub_num`, `pub_type`, `pub_token`, `pub_code`, `u_id`) VALUES ('ceshi1', 'wxd485da6402f9c972', '5256658af31c7e5a4f760bd3cbe06bf0', 's181863', 4, 'uU4JLKorBIc54wh4ClNcs0wb814HfbE0', 'dnORTR', 1)
INSERT INTO `menu` (`pub_id`, `m_name`) VALUES (6, NULL)

	private function AccessToken($id,$appid,$appsecret)
	{
		$access = new Access();
		$arr=$access->find()->where(['pub_id' => $id])->one();
---
SELECT * FROM `access` WHERE `pub_id`=6