models/Token.php

SELECT * FROM `access` WHERE `pub_id`='15'
---
	public function AccessToken($id,$appid,$appsecret)
	{
		$access = new Access();
		$arr=$access->find()->where(['pub_id' => $id])->one();